/*
"ก","ข","ฃ","ค","ฅ",
"ฆ","ง","จ","ฉ","ช",
"ซ","ฌ","ญ","ฎ","ฏ",
"ฐ","ฑ","ฒ","ณ","ด",
"ต","ถ","ท","ธ","น",
"บ","ป","ผ","ฝ","พ",
"ฟ","ภ","ม","ย","ร",
"ล","ว","ศ","ษ","ส",
"ห","ฬ","อ","ฮ"
*/

var th_consonant_braille = {
  ก:'\u281b',
  ข:'\u2805',
  ฃ:'\u2834'+'\u2805',
  ค:'\u2805',
  ฅ:'\u2824'+'\u2805',
  ฆ:'\u2820'+'\u2805',
  ง:'\u283b',
};

/*
"อะ","อา","อิ","อี",
"อึ","อื","อุ","อู",
"เอะ","เอ","แอะ","แอ",
"เอียะ","เอีย","เอือะ","เอือ",
"อัวะ","อัว","โอะ","โอ",
"เอาะ","ออ","เออะ","เออ",
"อำ","ใอ","ไอ","เอา",
"ฤ","ฤๅ","ฦ","ฦๅ"
*/

var th_vowel_braille = {

};

/*
*/

var th_tone_braille = {

};

/*
*/

var number_brailler = {

};

module.exports = {
  getConsonantDict:function(){
    return th_consonant_braille;
  }
}
